In [2]:
import pandas as pd
people = {
    "first": ["Corey", 'Jane', 'John', 'Mary'], 
    "last": ["Schafer", 'Doe', 'Doe', 'Jane'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', 'MaryJane@email.com']
}
df = pd.DataFrame(people)

In [4]:
# Series of combines columns
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
3        Mary Jane
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe
3   Mary     Jane       MaryJane@email.com      Mary Jane

In [7]:
# Removing 'first' and 'last' Columns
df.drop(columns = ['first', 'last'], inplace=True)

In [14]:
# Splitting 'full_name' column and then setting first and last name appropriately
df['full_name'].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3   Mary     Jane

In [15]:
df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)

In [18]:
# Adding Rows
pd.concat([df, pd.DataFrame.from_records([{'first': 'Tony'}])])

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       MaryJane@email.com      Mary Jane   Mary     Jane
0                      NaN            NaN   Tony      NaN

In [19]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["Tony@gmail.com", 'Steve@email.com']
}
df2 = pd.DataFrame(people)
df2

   first    last            email
0   Tony   Stark   Tony@gmail.com
1  Steve  Rogers  Steve@email.com

In [22]:
#Appending one df to another DOESNT WORK IN CURR VERSION
#df.append(df2, ignore_index=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       MaryJane@email.com      Mary Jane   Mary     Jane

In [25]:
#Removing rows
df.drop(index=0, inplace=True)

In [29]:
# Conditionally removing rows
df.drop(index = df[df['last'] == 'Doe'].index, inplace=True)

In [30]:
df

                email  full_name first  last
3  MaryJane@email.com  Mary Jane  Mary  Jane

In [31]:
people = {
    "first": ["Corey", 'Jane', 'John', 'Mary'], 
    "last": ["Schafer", 'Doe', 'Doe', 'Jane'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', 'MaryJane@email.com']
}
df = pd.DataFrame(people)

In [33]:
#Sorting a column
df.sort_values(by='last')

   first     last                    email
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Mary     Jane       MaryJane@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [34]:
#Sorting by multiple columns 
# ascending is parallel to reverse=True
df.sort_values(by=['last', 'first'], ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Mary     Jane       MaryJane@email.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com

In [35]:
#same as above but for alternating ascending order for each column
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [36]:
#Resetting the df can be done by sorting by index
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Mary     Jane       MaryJane@email.com